app/controllers/posts_controller.rb

SELECT * FROM "posts"
---
  def index
#    @posts = Post.all
    @posts = Post.search('test')

INSERT INTO "posts" ("created_at", "title", "updated_at", "text") VALUES('2011-01-22 00:43:31', '123', '2011-01-22 00:43:31', '123')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save